let typingInProgress = false;

generateName = function() {
    if (typingInProgress) return;

    const databases = {
        names = [
        "Александр", "Мария", "Дмитрий", "Екатерина", "Сергей",
        "Анна", "Иван", "Ольга", "Максим", "Елена",
        "Анастасия", "Николай", "Татьяна", "Владимир", "Ксения",
        "Светлана", "Артем", "Полина", "Денис", "Дарья",
        "Игорь", "Юлия", "Егор", "Варвара", "Роман",
        "Маргарита", "Станислав", "Кристина", "Михаил", "Людмила",
        "Олег", "Алёна", "Виктор", "Евгения", "Арсений",
        "Алина", "Семен", "Инна", "Тимур", "Оксана",
        "Григорий", "Вероника", "Андрей", "Яна", "Кирилл",
        "Евдокия", "Валентин", "Зинаида", "Савелий", "София",
        "Виктория", "Эмилия", "Анатолий", "Надежда", "Тихон",
        "Даниил", "Софья", "Ярослав", "Мира", "Тимофей",
        "Нина", "Алексей", "Лилия", "Варвара", "Арина",
        "Татьяна", "Степан", "Полина", "Леонид", "Ксения",
        "Дмитрий", "Рената", "Анастасия", "Злата", "Фёдор",
        "Станислава", "Тимур", "Евгений", "Лариса", "Светлана",
        "Никита", "Милена", "Яна", "Кирилл", "Роман",
        "Лев", "Саша", "Дина", "Елена", "Алевтина",
        "Арсений", "Савелий", "Инна", "Родион", "Валерия",
        "Айгуль", "Зарина", "Майя", "Наталья", "Динара",
        "Леонид", "Галина", "Валентина", "Станислав", "Тихон",
        "Роман", "Павел", "Светлана", "Оксана", "Людмила",
        "Кирилл", "Даша", "Савва", "Надежда", "Тимур",
        "Евгений", "Юлия", "Ксения", "Анастасия", "Тихон",
        "Виктор", "Софья", "Константин", "Алина", "Георгий",
        "Станислав", "Кристина", "Яна", "Дмитрий", "Николай",
        "Елизавета", "Филипп", "Роман", "Алла", "Анатолий",
        "София", "Марк", "Зинаида", "Евдокия", "Ярослав",
        "Лилия", "Евгения", "Тимофей", "Ульяна", "Валентина",
        "Семен", "Светлана", "Кирилл", "Агриппина", "Ада",
        "Вероника", "Людмила", "Анатолий", "Эдуард", "Григорий",
        "Мирослава", "Настасья", "Пелагея", "Злата", "Анастасия",
        "Олег", "Данила", "Тихон", "Ярослав", "Лев",
        "Станислав", "Дина", "Герман", "Виктор", "Алексей",
        "Ксения", "Лариса", "Соломония", "Никита", "Кирилл",
        "Ариана", "Варвара", "Евгений", "Злата", "Маргарита",
        "Диана", "Валентина", "Фаина", "Григорий", "Платон",
        "Клим", "Софья", "Мирослава", "Родион", "Инна",
        "Даша", "Елена", "Елизавета", "Ян", "Артемий",
        "Тимур", "Милена", "Светлана", "Татьяна", "Зинаида",
        "Евдокия", "Алена", "Филипп", "Виктор", "Лия",
        "Лео", "Эльвира", "Станислав", "Рита", "Агата",
        "Зина", "Ольга", "Станислав", "Ирина", "Валерия",
        "Александра", "Валентин", "Стефания", "Евгений", "Денис",
        "Афанасий", "Ким", "Геннадий", "Тимофей", "Пётр",
        "Мирослава", "Инга", "Эмилия", "Давид", "Илона",
        "Флора", "Сарра", "Лука", "Мирослав", "Станислав",
        "Эдита", "Тимур", "Александр", "Милена", "Савелий",
        "Дина", "Тамара", "Светлана", "Тихон", "Герман",
        "Наталья", "Вера", "Александр", "Константин", "Селена",
        "Роман", "Алиса", "Евгений", "Григорий", "Инна",
        "Стефан", "Валерий", "Татьяна", "Клара", "Анатолий",
        "Ярослава", "Алексей", "Моисей", "Аполлинария", "Генриетта",
        "Софья", "Давид", "Эдгар", "Феликс", "Николай",
        "Лидия", "Леонард", "Афанасий", "Яна", "Валентин",
        "Никита", "Роза", "Эльза", "Станислав", "Светлана",
        "Ольга", "Тимур", "Долорес", "Гарри", "Борис",
        "Ариадна", "Эмма", "Серафима", "Ксения", "Леонид",
        "Тимур", "Алина", "Денис", "Кирилл", "Григорий",
        "Ольга", "Николай", "Савелий", "Виктория", "Анастасия",
        "Оксана", "Ярослав", "Серафим", "Марина", "Дмитрий",
        "Злата", "Эльвира", "Даниил", "Кирилл", "Андрей",
        "Павел", "Михаил", "Анастасия", "Светлана", "Евгений",
        "Аделина", "Летисия", "Станислав", "Татьяна", "Тимофей",
        "Аглая", "Ярослав", "Даниэла", "Фаина", "Афина",
        "Семен", "Станислав", "Наталья", "Радмила", "Кристина",
        "Эмиль", "Зенит", "Аполлон", "Галактика", "Элис",
        "Зоряна", "Светозар", "Ника", "Светлана", "Агата",
        "Станислав", "Роман", "Софья", "Леонид", "Анастасия",
        "Лидия", "Людмила", "Павел", "Ясмин", "Снежана",
        "Тимур", "Элеонора", "Светлана", "Станислав", "Анатолий",
        "Алена", "Юлиан", "Злата", "Даниил", "Аниса",
        "Милослав", "Тимур", "Светослава", "Альвина", "Эдгар",
        "Дариус", "Григорий", "Анастасия", "Платон", "Светлана",
        "Степан", "Аделина", "Димитрий", "Лариса", "Ксения",
        "Данила", "Тимур", "Харитина", "Роман", "Любовь",
        "Светлана", "Радмир", "Тихон", "Марьяна", "Элина",
        "Александр", "Мирона", "Агния", "Серафим", "Ян",
        "Наталья", "Светозар", "Тимур", "Милена", "Лука",
        "Герман", "Эмилия", "Камилла", "Валентин", "Ариша",
        "Кирилл", "Лев", "Злата", "Анастасия", "Ульяна",
        "Федор", "Ксения", "Ярослав", "Леонид", "Григорий",
        "Богдан", "Алиса", "Леонид", "Тимофей", "Леонард",
        "Марианна", "Зоя", "Анатолий", "Сария", "Клим",
        "Лилия", "Георгий", "Светлана", "Аполлония", "Мирослава",
        "Констанция", "Станислава", "Родион", "Лотос", "Алексиса",
        "Адам", "Ариана", "Иванна", "Николета", "Бронислава",
        "Калерия", "Роксана", "Фрида", "Демиан", "Сабина",
        "Бенжамин", "Тимур", "Дабид", "Людмила", "Данис",
        "Сарра", "Элиза", "Эрнест", "Анастасия", "Милослава",
        "Есения", "Алиса", "Леон", "Ксения", "Радмир",
        "Виктория", "Тимур", "Савелий", "Светлана", "Радосвет",
        "Лиана", "Галина", "Ольга", "Эвелина", "Афродита",
        "Грета", "Жанна", "Фаина", "Татьяна", "Илона",
        "Элиана", "Наиля", "Светозар", "Дина", "Тимур",
        "Света", "Кира", "Станислав", "Мирослава", "Эмма",
        "Тимур", "Роман", "Леонид", "Аглая", "Григорий",
        "Луиза", "Эммануэль", "Тихон", "Эдит", "Давид",
        "Станислав", "Алиса", "Ариана", "Злата", "Клим",
        "Лилия", "Тимур", "Светлана", "Анастасия", "Родион",
        "Станислав", "Алексей", "Вероника", "Леонард", "Валентина",
        "Ксения", "Григорий", "Ирина", "Лариса", "Юлия",
        "Эльвира", "Кристина", "Светлана", "Тимур", "Анастасия",
        "Анастасия", "Станислав", "Светозар", "Илья", "Ксения",
        "Денис", "Тимур", "Григорий", "Леонид", "Зоя",
        "Алина", "Вероника", "Филипп", "Людмила", "Агата",
        "Светлана", "Александр", "Мирослава", "Эллада", "Милослава"
        ];
    data_names2 = ["Марат пидорас", "Вова гей", "Глеб лизал Ане", "Вова делал КУНИ ЛЕРЕ!"];
}

    const randomIndex = Math.floor(Math.random() * databases.data_names2.length);
    const randomName = names[randomIndex];
    typeWriter(randomName);
}

typeWriter = function(text) {
    const resultElement = document.getElementById('result');
    resultElement.innerHTML = '';
    typingInProgress = true;

    let i = 0;
    const speed = 100;

    let type = function() {
        if (i < text.length) {
            resultElement.innerHTML = text.substring(0, i + 1) + '<span>|</span>';
            i++;
            setTimeout(type, speed);
        } else {
            resultElement.innerHTML = text;
            typingInProgress = false;
        }
    }

    type();
}
